E1mpire/HelloMaker-STM32/备份/main.cpp
#include <stdio.h>
#include "hardwareserial.h"
#include "imu_data.h"
#include "motor.h"
#include "encoder.h"
#include "battery.h"
#include "led.h"
#include "PID.h"
#include "Kinematics.h"
#include <dl_msgs/Velocities.h>
#include <geometry_msgs/Twist.h>
#include <geometry_msgs/Vector3.h>
#include "timer.h"
#include "FlySkyIBus.h"
#include "FUTABA_SBUS.h"
#include "Protocol.h"
#include "STM32Hardware.h"
#include "stmflash.h"
#include "PWM.h"
#include <math.h>
#include "Oled.h"
#include "sonar.h"
#include "drv_uart.h"
#include "control.h"
#include "track.h"

 

double required_angular_vel = 0,required_angular_vel_=0;
double required_linear_vel = 0,required_linear_vel_=0;
int required_linear_throttle,required_angular_throttle;
bool PC_start  = false;
bool PC_ControlServo = false;

// ?????
#define ROTATION_CENTRE 0.5   //??????????   



#if REDUCTION_RATIO == 5
#define NORMALMAXLINE   1.5
#define NORMALMAXANGLE  1.2  //1.57// 0.7855
#elif REDUCTION_RATIO <= 15
#define NORMALMAXLINE   1.0
#define NORMALMAXANGLE  1.2  //1.57// 0.7855
#elif REDUCTION_RATIO >= 30
#define NORMALMAXLINE   0.7
#define NORMALMAXANGLE  1.0  //1.57// 0.7855



#endif
double required_Servo_pos = 0;
uint32_t previous_location_time = 0;
uint32_t previous_command_time = 0;
uint32_t previous_LoRa_time =0;
bool is_first = true;
static bool imu_is_initialized = false;
int PS2_LX,PS2_LY,PS2_RX,PS2_RY,PS2_KEY;  
int ServoPosID = 0;

int s_Uploadvx;
int s_Uploadvy;
int s_Uploadvz;

int Uploadvx;
int Uploadvy;
int Uploadvz;
#if IBUS_EN
#define BIAS_ADJUST  1
#elif SBUS_EN
  #if FUTABA 
  #define BIAS_ADJUST  1
  #define LINEAR_ADJUST 0
  #elif FLYSKY
  #define BIAS_ADJUST  1
  #elif SIYI
  #define BIAS_ADJUST  1
  #elif YUNZHUO
  #define BIAS_ADJUST  1
  #else 
  #define BIAS_ADJUST  0
  #endif
#endif
#if LINEAR_ADJUST  //?????????????????????????,??��?????????pwm?????????
float F_Slope = 0.00755;
float B_Slope = 0.0506;
float F_Const = 0.0;
float B_Const = 0.0;
#endif

#if BIAS_ADJUST
bool   FrontAdjust=0,BackAdjust=0;
double FL_scale = 1.0;
double FR_scale = 1.0;
double BL_scale = 1.0;
double BR_scale = 1.0;

u16  DataAddress[2] = {0};
#define READ_FRONT_ADDR  0x08018000
#define WRITE_FRONT_ADDR 0x08018000 

#define READ_BACK_ADDR   0x08019000  
#define WRITE_BACK_ADDR  0x08019000
//#define SIZE sizeof(DataAddress)	 	//?1?7?1?7?1?7?A?1?7?1?7
#define SIZE sizeof(DataAddress) / sizeof(u16)	 		  	//?1?7?1?7?1?7?A?1?7?1?7	

uint16 f_bias,b_bias=200;
uint8 data_h,data_l;

#define BIAS_SACLE   0.90
#endif
int Pulsewidth_Bias = 1500;

int ii = 0;
static int i = 0;
FUTABA_SBUS sBus;   
PID motor1_pid(-240, 240, K_P, K_I, K_D);
PID motor2_pid(-240, 240, K_P, K_I, K_D);

Encoder encoder1(ENCODER1, 0xffff, 0, LCOUNTS_PER_REV);
Encoder encoder2(ENCODER2, 0xffff, 0, RCOUNTS_PER_REV);
Battery bat(25, 10.6, 12.6);
Kinematics kinematics(MAX_RPM, WHEEL_DIAMETER, BASE_WIDTH,FR_WHEELS_DISTANCE, LR_WHEELS_DISTANCE);
Led led;
dl_msgs::Velocities raw_vel_msg;
Kinematics::rpm req_rpm;
FlySkyIBus IBus;
Protocol dlProtocol;
float  pitch;
geometry_msgs::Vector3 accel , gyro;
int alam_anlge = 0;
u32 TrigTime;
bool Trig = false;
uint32_t previous_flysky_time = 0;
uint32_t previous_movebase_time = 0;
uint32_t previous_servo_time = 0;
uint32_t previous_test_time = 0;


int Goal_PSS_RX_VALUE = 0;
int Goal_PSS_RY_VALUE = 0;
int Cur_PSS_RX_VALUE = 0;
int Cur_PSS_RY_VALUE = 0;
int PSS_RY_VALUE = 0;
int PSS_RX_VALUE = 0;

int Goal_PC_RX_VALUE = 0;
int Goal_PC_RY_VALUE = 0;
int Cur_PC_RX_VALUE = 0;
int Cur_PC_RY_VALUE = 0;


int PulsewidthX = 0;
int PulsewidthY = 0;
int Pulsewidth_PID = 0;




#if YUNZHUO
#define PulsewidthX_mid  1002
#define PulsewidthX_max  1722
#define PulsewidthX_min  282

#define PulsewidthY_mid  1002
#define PulsewidthY_max  1722
#define PulsewidthY_min  282
#else
#define PulsewidthX_mid  992
#define PulsewidthX_max  1712
#define PulsewidthX_min  272

#define PulsewidthY_mid  992
#define PulsewidthY_max  1712
#define PulsewidthY_min  272
#endif
#define MOTOR_PROTEC   1

#if DECORDE_EN
#define SBUS_PID   1
#else
#define SBUS_PID   0
#endif
#define SBUS_LOW   200
#define SBUS_MID   1000
#define SBUS_HIGH  1800
#define SBUS_BIAS  200

#if DECORDE_EN
#define IBUS_PID   1
#else
#define IBUS_PID   0
#endif
#define IBUS_LOW   1000
#define IBUS_MID   1500
#define IBUS_HIGH  2000
#define IBUS_BIAS  100


#if DECORDE_EN
#define PPM_PID   1
#else
#define PPM_PID   0
#endif
#define PPM_LOW   600
#define PPM_MID   1100
#define PPM_HIGH  1600
#define PPM_BIAS  100

#define STICK_BIAS 25

int PulsewidthZ = 0;
int PulsewidthW = 0;
int Pulsewidth_Alarm = 1500;
#if IBUS_EN
int Pulsewidth_Power =    1500;
int Pulsewidth_switch1 =  1000;
int Pulsewidth_switch2 =  1000;
int Pulsewidth_S1  = 1000;
int Pulsewidth_S2  = 1000;


int Pulsewidth_Pole  = 1000;
#elif SBUS_EN
int Pulsewidth_Power   =  1000;
int Pulsewidth_switch1 =  200;
int Pulsewidth_switch2 =  200;
int Pulsewidth_S1  = 200;
int Pulsewidth_S2  = 200;

extern Motor motor1;
extern Motor motor2;
extern Motor motor3;
extern Motor motor4;

#elif PPM_EN
int Pulsewidth_Power = 1100;
#endif

bool rc_stable = false;
bool pole_active = false;
int step =  20;
int STABLE_NUM_X  =20;
int STABLE_NUM_Y  =20;
bool b_rc_idle  = true;
bool g_forcestop = false;
bool UrgencyStop = false;

char str[50];
uint32_t previous_alarm_time = 0;
long long temp_x,temp_y; 
int ppm_channels[10] = {0};
bool Isloop   = false;
bool IsUnloop = true;
int s1,s2,s3,s4,time;


uint8_t REMOTE_CONTROL_FLAG = 1; //符号位为1则为遥控器模式
#if BIAS_ADJUST
void ProjectModeGpioInit(void)
{
   GPIO_InitTypeDef GPIO_InitStructure;
   RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
   GPIO_InitStructure.GPIO_Pin	   = GPIO_Pin_8 | GPIO_Pin_15;
   GPIO_InitStructure.GPIO_Mode    = GPIO_Mode_IPU;
   GPIO_Init(GPIOA, &GPIO_InitStructure);
   GPIO_SetBits(GPIOA,GPIO_Pin_8 | GPIO_Pin_15);
}


bool IsEnterProjectMode2(void)
{
   bool ProjectMode;
   ProjectMode = GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_15);
   return !ProjectMode;

}

bool IsEnterProjectMode1(void)
{
   bool ProjectMode;
   ProjectMode = GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_8);
   return !ProjectMode;

