E1mpire/HelloMaker-STM32/备份/main.cpp
}

int ConnectCheck(void){
    if(PulsewidthX == 0 || PulsewidthY == 0)
	{ 
	  b_rc_idle = true;
	  if(req_rpm.motor1 == 0 && req_rpm.motor2 == 0 &&  PC_start == false)
	  	{
	      motor1.spin(0);
	      motor2.spin(0);
	  	}
	  return 1;
	}
    return 0;
}

void LoopControl(void){
	
	   required_linear_vel_ = (float)Goal_PSS_RY_VALUE /240 * NORMALMAXLINE;
	   #if IBUS_EN
	   if(PulsewidthY > IBUS_MID + STICK_BIAS)  required_angular_vel_ =   -(float)Goal_PSS_RX_VALUE /240 * NORMALMAXANGLE;
	   else if(PulsewidthY < IBUS_MID - STICK_BIAS)  required_angular_vel_ =   (float)Goal_PSS_RX_VALUE /240 * NORMALMAXANGLE;
	   #elif SBUS_EN
       if(PulsewidthY > SBUS_MID + STICK_BIAS)  required_angular_vel_ =	 -(float)Goal_PSS_RX_VALUE /240 * NORMALMAXANGLE;  
	   else if(PulsewidthY < SBUS_MID - STICK_BIAS) required_angular_vel_ =	(float)Goal_PSS_RX_VALUE /240 * NORMALMAXANGLE;
	   #elif PPM_EN
       if(PulsewidthY > PPM_MID + STICK_BIAS)  required_angular_vel_ =	 -(float)Goal_PSS_RX_VALUE /240 * NORMALMAXANGLE;  
	   else if(PulsewidthY < PPM_MID - STICK_BIAS) required_angular_vel_ =	(float)Goal_PSS_RX_VALUE /240 * NORMALMAXANGLE;
	   #endif
	   #if !PWM_EN
	   else  required_angular_vel_ =   -(float)Goal_PSS_RX_VALUE /240 * NORMALMAXANGLE;   
	   #endif
	   if(required_linear_vel_ < 0.02 &&  required_linear_vel_ > -0.02 )  required_linear_vel_ = 0;	
	   if(required_angular_vel_ < 0.02 &&	required_angular_vel_ > -0.02)  required_angular_vel_ = 0;	
	   Isloop = true;
       if(IsUnloop == true)
       	{
            IsUnloop = false; 
			Cur_PSS_RX_VALUE = 0;
			Cur_PSS_RY_VALUE = 0;
        }
	
}

#if IBUS_EN
void IBUS_Relay(void)
{
  #if 0
  if(Pulsewidth_Pole < IBUS_MID + STICK_BIAS && Pulsewidth_Pole > IBUS_MID - STICK_BIAS)	pole_active = true;
   if(pole_active == true && g_forcestop == false)
	  {
		if(Pulsewidth_Pole	< IBUS_LOW + IBUS_BIAS) Switch(1,TRUE),Switch(2,FALSE);
		else if(Pulsewidth_Pole > IBUS_MID - STICK_BIAS && Pulsewidth_Pole < IBUS_MID + STICK_BIAS)Switch(1,FALSE), Switch(2,FALSE);
		else if(Pulsewidth_Pole > IBUS_MID + STICK_BIAS)  Switch(1,FALSE),Switch(2,TRUE);
	  }
  #endif
        if(Pulsewidth_switch1 < IBUS_LOW + IBUS_BIAS)GPIO_SetBits(GPIOC, GPIO_Pin_15); 
		else GPIO_ResetBits(GPIOC, GPIO_Pin_15); 

		if(Pulsewidth_switch2 < IBUS_LOW + IBUS_BIAS)GPIO_SetBits(GPIOC, GPIO_Pin_14); 
		else GPIO_ResetBits(GPIOC, GPIO_Pin_14); 
		
}
#endif

#if SBUS_EN
void SBUS_Relay(void)
{
   if(Pulsewidth_switch1 < SBUS_LOW + SBUS_BIAS)  Switch(1,FALSE); 
   else  Switch(1,TRUE);
   if(Pulsewidth_switch2 < SBUS_LOW + SBUS_BIAS)  Switch(2,FALSE); 
   else  Switch(2,TRUE);		
}
#endif

int SignalStableCheck(void)
{
	if(rc_stable == false)
	   {
	   #if IBUS_EN || PWM_EN
	   if( PulsewidthX > 1250 && PulsewidthX < 1750 && PulsewidthY > 1250 && PulsewidthY < 1750  ) rc_stable = true;
	   #elif SBUS_EN
	   if( PulsewidthX > 750 && PulsewidthX < 1250 && PulsewidthY > 750 && PulsewidthY < 1250	) rc_stable = true;
	   #elif PPM_EN
	   if( PulsewidthX > 900 && PulsewidthX < 1300 && PulsewidthY > 900 && PulsewidthY < 1300	) rc_stable = true;
	   #endif
	   else{
			 // motor1.spin(0);
			 // motor2.spin(0);
			   return 1;
		   }
	   }
	  return 0;
}

void RcControl(void)
{
  #if IBUS_EN
  if(Pulsewidth_PID > IBUS_LOW + IBUS_BIAS)	 
     LoopControl();
  else
  #elif SBUS_EN
  if(Pulsewidth_PID > SBUS_LOW + SBUS_BIAS)   
	 LoopControl();
  else
  #elif PPM_EN
  if(Pulsewidth_PID > PPM_LOW + PPM_BIAS)   
	 LoopControl();
  else
  #endif
  NonLoopControl();
 if(b_rc_idle == false)
	{
	  required_angular_vel = required_angular_vel_;
	  required_linear_vel = required_linear_vel_;
	}

}

#if SBUS_EN || IBUS_EN || PPM_EN
void ProtectSwitch(void)
{
    #if SBUS_EN
	if(Pulsewidth_Power < SBUS_LOW + SBUS_BIAS)
	#elif IBUS_EN
    if(Pulsewidth_Power < IBUS_LOW + IBUS_BIAS)
	#elif PPM_EN
    if(Pulsewidth_Power < PPM_LOW + PPM_BIAS)
	#endif
	 {
		 g_forcestop = true;
		 required_linear_vel = 0;
		 required_angular_vel=0;
		 motor1_pid.clear_pid();
		 motor2_pid.clear_pid();
		 Switch(1,FALSE); 
		 Switch(2,FALSE);	 
	 }
	else if( UrgencyStop == false){
		 g_forcestop = false;
	  }
}
#endif

#if SBUS_EN
void sbus_control(void)
{
	static int j = 0;
	sBus.FeedLine();
	if(sBus.toChannels == 1)
	  {
	   sBus.UpdateServos();
	   sBus.UpdateChannels();
	   sBus.toChannels = 0;
	   PulsewidthX			 =  sBus.channels[0];
       #if FLYSKY
		PulsewidthX          =  sBus.channels[0];
	    PulsewidthY          =  sBus.channels[1];
	    Pulsewidth_Power     =  sBus.channels[4];
		Pulsewidth_S1        =  sBus.channels[8];
	    Pulsewidth_S2        =  sBus.channels[9];
		Pulsewidth_switch1   =  sBus.channels[6];
	    Pulsewidth_switch2   =  sBus.channels[7];
		Pulsewidth_PID		 =  sBus.channels[5];
       #if BIAS_ADJUST
        #if CHANNEL == 6
		Pulsewidth_Bias 	 =	sBus.channels[5];
         #else
		if(FrontAdjust == 1)	 Pulsewidth_Bias	  =  sBus.channels[8];
		else if(BackAdjust == 1) Pulsewidth_Bias	  =  sBus.channels[9];
        #endif
        #endif

		
		if(Pulsewidth_Bias  > 1712) Pulsewidth_Bias = 1712;
        else if(Pulsewidth_Bias  < 272) Pulsewidth_Bias = 272;
	    #else
		   #if FUTABA
		   PulsewidthY			=  sBus.channels[1];
		   Pulsewidth_Bias      =  sBus.channels[2];
		   #elif SIYI || YUNZHUO
	       PulsewidthY			=  sBus.channels[2];
		   if(FrontAdjust == 1)	    Pulsewidth_Bias	  =  sBus.channels[11];
	       else if(BackAdjust == 1) Pulsewidth_Bias	  =  sBus.channels[12];
		   #endif
		   
		   Pulsewidth_Power	    =  sBus.channels[4];
		   Pulsewidth_PID		=  sBus.channels[5];
		   Pulsewidth_switch1	=  sBus.channels[6];
		   Pulsewidth_switch2	=  sBus.channels[7];
		   Pulsewidth_S1        =  sBus.channels[12];
	       Pulsewidth_S2        =  sBus.channels[11]; 
	   #endif
	  }

  
  if(ConnectCheck())return ;
  if(SignalStableCheck())return ;
  ProtectSwitch();
  RC_Common();
  #if RELAY_EN
  SBUS_Relay();	
  #endif
  #if SBUS_PID
  RcControl();
  #else
  NonLoopControl();
  #endif 
 
}

#elif IBUS_EN
void ibus_control(void)
{
	int i =0;
	static int j = 0;
	for( i = 0;i< 10;i++)   IBus.Channel[i] = IBus.readChannel(i);
    PulsewidthX          =  IBus.Channel[0];
    PulsewidthY          =  IBus.Channel[1];
    Pulsewidth_Power     =  IBus.Channel[4];
	Pulsewidth_S1        =  IBus.Channel[8];
    Pulsewidth_S2        =  IBus.Channel[9];
	Pulsewidth_switch1   =  IBus.Channel[6];
    Pulsewidth_switch2   =  IBus.Channel[7];
	Pulsewidth_Pole      =  IBus.Channel[6];
//	Pulsewidth_Alarm           =  IBus.Channel[8];
	#if BIAS_ADJUST
	#if CHANNEL == 6
    Pulsewidth_Bias      =  IBus.Channel[5];
	#else
	if(FrontAdjust == 1)     Pulsewidth_Bias      =  IBus.Channel[8];
	else if(BackAdjust == 1) Pulsewidth_Bias      =  IBus.Channel[9];
	#endif
	#endif
	#if IBUS_PID
	#if CHANNEL == 6
	if(BackAdjust == 0 && FrontAdjust == 0)
	#endif
    Pulsewidth_PID       =  IBus.Channel[5];
	#endif
    if(ConnectCheck())return ;
	if(SignalStableCheck())return ;
	ProtectSwitch();
	#if RELAY_EN
	IBUS_Relay();
	#endif
	RC_Common();
    #if IBUS_PID
	RcControl();
    #else
	NonLoopControl();
    #endif
		
