E1mpire/HelloMaker-STM32/备份/main.cpp
		 #elif SBUS_EN
			 #if FUTABA
	         if(f_bias > 1200) f_bias = 1000;
				 else if(f_bias < 800) b_bias = 1000;
				 if(f_bias > 1000)
				  { 	
					FR_scale = dl_map(1200-f_bias,0,200,BIAS_SACLE,1.0);
					FL_scale = 1.0;
				  }
				 else if(f_bias <= 1000)
				  {
					FR_scale = 1.0;
					FL_scale = dl_map(f_bias-800,0,200,BIAS_SACLE,1.0);			   
				  } 
			 #elif SIYI || FLYSKY || YUNZHUO
             if(f_bias > 1800) f_bias = 992;
				 else if(f_bias < 200) b_bias = 992;
				 if(f_bias > 992)
				  { 	
					FR_scale = dl_map(1712-f_bias,0,720,BIAS_SACLE,1.0);
					FL_scale = 1.0;
				  }
				 else if(f_bias <= 992)
				  {
					FR_scale = 1.0;
					FL_scale = dl_map(f_bias-272,0,720,BIAS_SACLE,1.0);			   
				  } 
			 #endif
		 #endif
			
	}
     if( BackAdjust == 0)
	  {
		STMFLASH_Read(READ_BACK_ADDR,(u16*)DataAddress,SIZE);
		b_bias = DataAddress[0];

		#if IBUS_EN
			if(b_bias > 2000) b_bias = 1500;
			else if(b_bias < 1000) b_bias = 1500;
			if(b_bias > 1500)
			  { 	
				BR_scale = dl_map(2000-b_bias,0,500,BIAS_SACLE,1.0);
				BL_scale = 1.0;
			  }
			 else if(b_bias <= 1500)
			  {
				BR_scale = 1.0;
				BL_scale = dl_map(b_bias-1000,0,500,BIAS_SACLE,1.0);	   
			  }   
		 #elif SBUS_EN

		     #if FUTABA
	         if(b_bias > 1200) b_bias = 1000;
			 else if(b_bias < 800) b_bias = 1000;
			 if(b_bias > 1000)
			  { 	
				BR_scale = dl_map(1200-b_bias,0,200,BIAS_SACLE,1.0);
				BL_scale = 1.0;
			  }
			 else if(b_bias <= 1000)
			  {
				BR_scale = 1.0;
				BL_scale = dl_map(b_bias-800,0,200,BIAS_SACLE,1.0);	   
			  } 
			 #elif SIYI || FLYSKY || YUNZHUO
             if(b_bias > 1800) b_bias = 992;
			 else if(b_bias < 200) b_bias = 992;
			 if(b_bias > 992)
			  { 	
				BR_scale = dl_map(1712-b_bias,0,720,BIAS_SACLE,1.0);
				BL_scale = 1.0;
			  }
			 else if(b_bias <= 992)
			  {
				BR_scale = 1.0;
				BL_scale = dl_map(b_bias-272,0,720,BIAS_SACLE,1.0);	   
			  } 
			 #endif
		 #endif
	  }
}

#endif

#if SERVO_EN
void TaskTimeHandle(void)
  {
	static uint32 time = 20;
	if(gSystemTickCount > time)
	  {
		  time += 20;
		  ServoPwmDutyCompare();		
	  }
   }
#endif
/*
----------------------------------------------------------------------------------
*/
// LoRa系数定义

uint8_t Remote_on[8] = {'1','2','3','4','5','6','7','8'};  //????onRemote????????
uint8_t Remote_off[8] = {'8','7','6','5','4','3','2','1'};  //????ffRemoteof???????? 
uint8_t LR_Adjust[8] = {'4','4','4','4','4','4','4','4'};
uint8_t LoRa_buffer[100] = {0};
uint8_t RxLength = 0;
char Remote_message[30] =  {'R','e','m','o','t','e',' ','C','o','n','t','r','o','l',' ','a','c','t','i','v','a','t','e'};
char Self_message[30] = {'S','e','l','f',' ','C','o','n','t','r','o','l',' ','a','c','t','i','v','a','t','e'};
char error_message[30] = {'C','o','m','m','a','n','d','  ',' i','n',' ','w','r','o','n','g',' ','f','o','r','m','a','t'};

uint8_t Remote_on_flag = 0;
uint8_t Remote_off_flag = 0;
/*---------------------------------------------------------------------------*/
int main(void) 
{

	
	// ????
	bool OnOff = false;
	// ???????
    char buffer[50];
	// ????????????????led??????? 
    uint32_t publish_vel_time = 0;
	uint32_t previous_imu_time = 0;
	uint32_t previous_oled_time = 0;
	uint32_t previous_led_time = 0;
    uint32_t previous_debug_time = 0;
	uint32_t previous_motorprotec_time = 0;
	uint32_t previous_control_time = 0;
	uint32_t previous_battery_debug_time = 0;
	//uint32_t previous_sonic_time = 0;
	// ???????????
	char battery_buffer[]= "The voltage is lower than 11.3V,Please charge! ";

	// ?????????????????????????????????led???GPIO
	SystemInit();
	initialise();
	motor1.init();
	motor2.init();
	motor3.init();
	motor4.init();
	motor1.spin(0);
	motor2.spin(0);
	motor3.spin(0);
	motor4.spin(0);
	encoder1.init();
	encoder2.init();
	led.init();
	bat.init();
	#if RELAY_EN
	SwitchGpioInit();
   // Switch(0,FALSE);
	#endif
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO,ENABLE);	  
	//-------JTAG------
	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable,ENABLE);

	#if OLED_EN
	OLED_Init();
	#endif

	#if SERVO_EN
	InitPWM();
    InitTimer6();
	#endif

	// Serial口初始化
	SerialPrint.begin(115200);
	dlProtocol.begin();
	drv_uart_init(9600);  //LoRa模块的波特率固定为9600
	sonar_init(65535-1,72-1);  //程序规定好了检测周期为65535如果要改要同时改变sonar.cpp中TIM8IRQ里的
	Track_Init(); //??????????

    #if IBUS_EN
    SerialBus.begin(115200);
    IBus.begin();

	#elif SBUS_EN
    sBus.begin();// SBUS?????

	#elif PWM_EN
	TIM1_Cap_Init(0xFFFF,72-1);
	TIM2_Cap_Init(0xFFFF,72-1);
	#elif PPM_EN
	TIM1_Cap_Init(0xFFFF,72-1);
	#endif
    #if BIAS_ADJUST 
    Bias_check();  //?????????
	#endif
	// led????
	led.on_off(OnOff);

	//test_control();


	/*-------------------------------???????????------------------------------------------*/
	// ?????
	#if 1
	while(1)
	{
		if((millis()-previous_LoRa_time)>=20)
	   {
		/*
		*LoRa通信模块，每20ms执行一次
		*/
		RxLength = drv_uart_rx_bytes(LoRa_buffer); //检测收到信号的长度
		if (RxLength != 0)
		{
			
			for(int i=0; i<8; i++)	
			{	
				// 判断属于哪一个指令
				if (LoRa_buffer[i]!=Remote_on[i] && Remote_on_flag!= 1)  Remote_on_flag = 1;
				if (LoRa_buffer[i]!=Remote_off[i] && Remote_off_flag!= 1)  Remote_off_flag = 1;
				//if (LoRa_buffer[i]!=LR_Adjust[i] && Remote_flag!= 100||110||111) Remote_flag +=100;

			}
			if (Remote_on_flag==1&&Remote_off_flag==1) //错误格式指令
			{
				drv_uart_tx_bytes((uint8_t*)error_message, 28);
				Remote_on_flag=0;
				Remote_off_flag=0;
			}
			else if (Remote_on_flag==0)
			{
				Stop();
				OLED_Clear();
				drv_uart_tx_bytes((uint8_t*)Remote_message, 23);
				REMOTE_CONTROL_FLAG = 1; //进入遥控模式
				Remote_off_flag = 0; //刷新符号位
			}
			else if (Remote_off_flag==0)
			{
				Stop();
				OLED_Clear();
				drv_uart_tx_bytes((uint8_t*)Self_message, 22);
				REMOTE_CONTROL_FLAG = 0;//刷新符号位
				Remote_on_flag = 0;
				#if FIGURE_CHECK
				l_cnt = 0;//清零姿态
				#endif
			}
			
		previous_LoRa_time = millis();
		}
	   }

	   #if CONNECT_DETEC
       if ((millis() - previous_command_time) >= 250){

		      if(b_rc_idle == true)  stop_base();
         }
	   #endif


        if(((millis() - previous_flysky_time) >= 1000 / IBUS_RATE) && REMOTE_CONTROL_FLAG)
        	{
			/*
			*程序控制模块1000/40=25ms执行一次
			*/   
        	  #if IBUS_EN
              ibus_control();     
			  #elif SBUS_EN
			  sbus_control();	
			  #elif PWM_EN
              pwm_control();
			  #elif PPM_EN
			  ppm_control();
              #endif
			  #endif
              previous_flysky_time = millis();				  
		    }

		#if (CONNECT_DETEC)
		if ((millis() - previous_command_time) >= 50 && !REMOTE_CONTROL_FLAG){  
			/*
			/PC??????????10ms???????????????????????
			*/
			test_control();
			//Highspeed_Forward();
			//Lowspeed_Forward();
			/*
			Forward_Left();
			delay(3000);
			Forward_Right();
			delay(3000);
			*/
		}


		#if 1
        if((millis() - previous_movebase_time) >= (1000 / MOVEBASE_RATE))
        	{
			/*
			*获取速度，但是因为没有码盘所以无效
			*/   
               getVelocities();
               previous_movebase_time = millis();	  
		    }
		#endif

	    #if TILT_DETEC 
        if ((millis() - previous_imu_time) >= (1000 / IMU_PUBLISH_RATE)){
            if(!imu_is_initialized)
				{
	                imu_is_initialized = initIMU();
	                if(imu_is_initialized){
	                   
	                }else{
	     
